{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "2", 
        "num_group": "1", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "2", 
        "num_group": "1", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_batchnorm_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_batchnorm_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv1_batchnorm", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_dw_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "2", 
        "num_group": "2", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_dw", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "2", 
        "num_group": "2", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_dw_batchnorm_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_dw_batchnorm_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_dw_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_dw_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_dw_batchnorm", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 1], [14, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "2", 
        "num_group": "1", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "2", 
        "num_group": "1", 
        "pad": "(0, 0)"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_weight", 
      "attrs": {"num_hidden": "4"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_bias", 
      "attrs": {"num_hidden": "4"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected0", 
      "attrs": {"num_hidden": "4"}, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    4, 
    5, 
    6, 
    9, 
    11, 
    12, 
    13, 
    14, 
    16, 
    19, 
    20, 
    22
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28
  ], 
  "heads": [[23, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10100]}
}